// •	Какое будет выведено значение: let x = 5; alert( x++ ); ?//5
// потому что сначало выводит значение, потом прибавляет еденицу alert(++x) дал бы 6
// •	Чему равно такое выражение: [ ] + false - null + true ?//NaN
//[] + false => "false" потому [] в таком виде переходит в ""
//"false" - null => NaN
// NaN + true = NaN
// •	Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?// 2 //цепочка справа налево
// •	Чему равна сумма [ ] + 1 + 2? // 12 (как в примере на строке 3)
// •	Что выведет этот код: alert( "1"[0] )? //1 // [0]- индекс строки
// •	Чему равно 2 && 1 && null && 0 && undefined?//null// слева направо. оператор && Всегда спотыкается на первой лжи 
//после первой лжи операция прекращается. //в случае с или операция прекращается на правде//
// •	Есть ли разница между выражениями? !!( a && b ) и (a && b)? //da первое это булиновое значение а второе это числоb
// •	Что выведет этот код: alert( null || 2 && 3 || 4 ); ? //3// && первое денйствие
// •	a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ? //net
//      разные хранилищи информации (ящики) но с одинаковыми данными. но ящики то разные
// •	Что выведет этот код: alert( +"Infinity" ); ? //Infinity число
// •	Верно ли сравнение: "Ёжик" > "яблоко"? // net t.k. Ё раньше я, тем самым меньше
// •	Чему равно 0 || "" || 2 || undefined || true || falsе ? //2
